app/Controllers/Login.php

SELECT *
FROM `tb_pic`
WHERE `user_pic` = 'ADF'
 LIMIT 1
---
    public function check(){
        $session = session();
        $modelPIC = new Pic_model;

        $username = $this->request->getGet("username");
        $password = $this->request->getGet("password");

        $dataPIC = $modelPIC->where('user_pic', $username)
                        ->first();