app/Controllers/Project.php

    public function index(){
        $modelPIC = new Pic_model;
        $modelProject = new Project_model;
        $modelCategory = new Category_model;
        $modelDeparment = new Department_model;
        $modelViewProject = new View_project_detail_model;

        $data['headerTitle'] = "Project";
        $data['currentPage'] = "Project";
        $data['dataPics'] = $modelPIC->findAll();
        $data['dataCategories'] = $modelCategory->findAll();
        $data['dateDepartment'] = $modelDeparment->findAll();
---
SELECT *
FROM `tb_pic`
SELECT *
FROM `tb_department`