app/Models/Category_model.php

SELECT `tb_category`.*, COUNT(IF(vw_summary_monthly.ach>1, 1, null)) AS faster, COUNT(IF(vw_summary_monthly.ach=1, 1, null)) AS ontime, COUNT(IF(vw_summary_monthly.ach<1, 1, null)) AS overdue
FROM `tb_category`
LEFT JOIN `vw_summary_monthly` ON `tb_category`.`category_name`=`vw_summary_monthly`.`category_name`
WHERE `vw_summary_monthly`.`date_monthly_activity` = '2022-01-01' OR `vw_summary_monthly`.`date_monthly_activity` is null
GROUP BY `tb_category`.`id_category`
---
    public function getSummaryByMonth($date){
        $builder = $this->db->table($this->table);
        $builder->select('tb_category.*, COUNT(IF(vw_summary_monthly.ach>1, 1, null)) AS faster, COUNT(IF(vw_summary_monthly.ach=1, 1, null)) AS ontime, COUNT(IF(vw_summary_monthly.ach<1, 1, null)) AS overdue');
        $builder->join('vw_summary_monthly', 'tb_category.category_name=vw_summary_monthly.category_name', 'left');
        $builder->where("vw_summary_monthly.date_monthly_activity='2022-01-01' OR vw_summary_monthly.date_monthly_activity is null");
        $builder->groupBy('`tb_category`.id_category');
        return $builder->get()->getResultArray();