app/Models/Department_model.php

    public function getDepartments(){
       return $this->findAll();
---
SELECT *
FROM `tb_department`

    public function getSummaryByMonth($date){
        $builder = $this->db->table($this->table);
        $builder->select('tb_department.*, COUNT(IF(vw_summary_monthly.ach>1, 1, null)) AS faster, COUNT(IF(vw_summary_monthly.ach=1, 1, null)) AS ontime, COUNT(IF(vw_summary_monthly.ach<1, 1, null)) AS overdue');
        $builder->join('vw_summary_monthly', 'tb_department.department_name=vw_summary_monthly.department_name', 'left');
        $builder->where("vw_summary_monthly.date_monthly_activity='2022-01-01' OR vw_summary_monthly.date_monthly_activity is null");
        $builder->groupBy('`tb_department`.department_name');
        $builder->orderBy('`tb_department`.`id_department`', 'ASC');
        return $builder->get()->getResultArray();
---
SELECT `tb_department`.*, COUNT(IF(vw_summary_monthly.ach>1, 1, null)) AS faster, COUNT(IF(vw_summary_monthly.ach=1, 1, null)) AS ontime, COUNT(IF(vw_summary_monthly.ach<1, 1, null)) AS overdue
FROM `tb_department`
LEFT JOIN `vw_summary_monthly` ON `tb_department`.`department_name`=`vw_summary_monthly`.`department_name`
WHERE `vw_summary_monthly`.`date_monthly_activity` = '2022-01-01' OR `vw_summary_monthly`.`date_monthly_activity` is null
GROUP BY `tb_department`.`department_name`
ORDER BY `tb_department`.`id_department` ASC