app/Models/Project_model.php

SELECT *
FROM `tb_project`
---
    public function getProjects(){
       return $this->findAll();

SELECT *
FROM `tb_project`
WHERE `achievement` = 'Close'
---
    public function getOpenProject(){
        $builder = $this->db->table($this->table);
        $builder->where('achievement', 'Open');
        return $builder->get()->getNumRows();

SELECT *
FROM `tb_project`
WHERE `achievement` = 'Cancel'
---
    public function getCloseProject(){
        $builder = $this->db->table($this->table);
        $builder->where('achievement', 'Close');
        return $builder->get()->getNumRows();